lst = [('Биліна', 'Олександра', 'Денисівна', 'ж', 20, 3),
       ('Богусевич', 'Денис', 'Анатолійович', 'ж', 19, 1),
       ('Говядін', 'Кирило', 'Олександрович', 'ж', 18, 1),
       ('Іспірян', 'Анна', 'Самвелівна', 'ч', 23, 3),
       ('Качуровська', 'Юлія', 'Сергіївна', 'ч', 18, 3),
       ('Ковальчук', 'Анна', 'Миколаївна', 'ж', 23, 2),
       ('Колко', 'Олександр', 'Олександрович', 'ч', 22, 3),
       ('Кухарук', 'Соломія', 'Тарасівна', 'ч', 18, 3),
       ('Міхуровська', 'Наталія', 'Іванівна', 'ж', 23, 2),
       ('Нгуєн', 'Фу', 'Даі', 'ч', 21, 1),
       ('Ромашко', 'Георгій', 'Романович', 'ж', 21, 3),
       ('Соловій', 'Катерина', 'Ігорівна', 'ж', 22, 2),
       ('Сугоняк', 'Роман', 'Ярославович', 'ч', 19, 1),
       ('Судейко', 'Ілля', 'Юрійович', 'ж', 19, 1),
       ('Ужвенко', 'Юлія', 'Константинівна', 'ж', 19, 2),
       ('Чоботар', 'Максим', 'Сергійович', 'ч', 18, 3),
       ('Чучман', 'Дмитро', 'Олександрович', 'ж', 19, 3),
       ('Щур', 'Олександр', 'Олегович', 'ж', 20, 3),
       ('Студент', 'Приклад', 'Надіславович', 'ж', 18, 1),
       ('Німець', 'Надіслав', 'Вікторович', 'ж', 18, 2)]
ages = []
names = []
dict = {}
couple = []
f = []
maxvalue = 0
maxkey = 0
for tuple in lst:
    xage = tuple[4]
    ages.append(xage)
for age in ages:
       if age in dict:
              dict[age] += 1
       else:
              dict[age] = 1

for key, value in dict.items():
         if value >= maxvalue:
              maxvalue = value
              maxkey = key
for tuple in lst:
       if maxkey == tuple[4]:
              couple.append(f'{tuple[0]} {tuple[1]} {tuple[2]}')
print(couple)